content-org/expressing-lambda-calculus-in-emacs-lisp.org
:properties:
:EXPORT_FILE_NAME: expressing-lambda-calculus-in-emacs-lisp
:ID:       750A295A-4B71-4024-963F-B2D62B9F1BA3
:END:
#+hugo_base_dir: ../
#+title: Expressing Lambda Calculus in Emacs Lisp
#+author: Mekael Turner
#+date: [2024-11-12]
#+filetags: functional_programming monoid javascript the_lambda_calculus


The lambda calculus is a foundational mathematical framework for studying functions. It forms the bedrock of functional programming, offering a powerful and elegant way to define and manipulate functions. Emacs Lisp, a dialect of Lisp heavily used within the Emacs editor, offers a flexible environment for exploring these concepts.

In this article, we'll embark on a journey to understand how the lambda calculus is expressed within Emacs Lisp, using illustrative examples to highlight the core concepts.

** Functions as Lambda Expressions

Let's begin by considering a simple function that adds 3 to a given number:

#+begin_src emacs-lisp
(let ((x 20))
  (+ x 3))
#+end_src

This code defines a function using the =let= construct, binding the variable =x= to the value 20 and then performing the addition. We can rewrite this using a lambda expression, a core construct of the lambda calculus:

#+begin_src emacs-lisp
((lambda (x) (+ x 3)) 20)
#+end_src

Here, we define a lambda function =(lambda (x) (+ x 3))=, which takes a single argument =x= and returns the result of adding 3 to it. The argument =20= is then passed to this function, yielding the same result as the previous =let= expression.

** Nested Lambdas: Simulating =let*=

The =let*= construct in Emacs Lisp allows for sequential binding of variables, where each subsequent variable can refer to previously defined ones. Let's consider an example:

#+begin_src emacs-lisp
(let* ((x 20)
	 (y x)
	 )
    x)
#+end_src

This code first binds =x= to 20 and then binds =y= to the value of =x=. It then returns the value of =x=. We can mimic this behavior with nested lambda functions:

#+begin_src emacs-lisp
((lambda (x)
     ((lambda (y) x) x)) 20)
#+end_src

The outer lambda binds =x= to 20. The inner lambda binds =y= to the value of =x= but ultimately returns the value of =x=, demonstrating that the binding of =y= doesn't affect the result.

** Currying: A Functional Approach

The nested lambda functions used above hint at a core concept in functional programming: /currying/. Currying transforms a function that takes multiple arguments into a series of functions, each taking a single argument. While not strictly currying, the nested lambda functions in the previous example illustrate a similar approach.

The outer lambda takes the first argument (=x=) and then returns the inner lambda, which takes the second argument (=y=). While the inner lambda in this example ignores the value of =y=, currying allows us to build up functions incrementally, one argument at a time. 

** Conclusion

Exploring the lambda calculus within Emacs Lisp provides valuable insights into the functional programming paradigm. By understanding how lambda expressions work and how they can be used to express concepts like =let*=, we gain a deeper understanding of the power and elegance of functional programming. As you continue your journey through the world of functional programming, remember that the lambda calculus is a potent tool, offering a unique and powerful way to represent and manipulate functions. 
